вкладка Зам/прораб в Мои планы идет перечесление всех планов, нужно навести порядок и продумать например просроченные выполненые в работе     
  итд то есть сделать удобным читтабельным далее во вкладке Смена идет перечисление всех кто сегодня в смене так же продумать и проработать     
  удобный список например по службам по тех кто распределен и все возможное продумать удобство для планирования видиния в смежных можно по      
  службам ну и продумать не помешает так же и в Люди. Все выше перечисленное касается и для Начальник смены так же продумать и навести красоту  
  удобство и порядок. Еще поговорим по Поручения сверку оставляем так же у диспетчеров, но еще подумаем и продумаем варианты, например          
  главный инженер заходит у себя видит текущие работы кто где работает и вдруг к нему приходит сверху он ткрывает приложение далее выбирает     
  браду или бригады и распределяет им работы сверху сначала отменяет план и назначает нужно продумать это но сделать максимально удобно как     
  понял       